<template>
    <div class="center-center">
        <div class="block modal-body" v-if="!registered">
            <div class="close" rel="register-company-close"></div>
            <a href="#" class="modal-body-header"
               style=" display: inline-block; border-radius: 23px;background-color: #ffcc00; padding: 10px 30px;">заявка</a>
            <div class="form">
                <div class="row">
                    <label for="name">имя:</label>
                    <input type="text" v-model="first_name" :class="{'error':errors['first_name']}" name="first_name">
                </div>
<!--                <div class="row">-->
<!--                    <label for="name">Фамилия:</label>-->
<!--                    <input type="text" v-model="last_name" :class="{'error':errors['last_name']}" name="last_name">-->
<!--                </div>-->
                <div class="row">
                    <label for="name">E-mail:</label>
                    <input type="email" v-model="email" :class="{'error':errors['email']}" name="email">
                </div>
                <div class="row">
                    <label for="name">телефон:</label>
                    <the-mask :mask="['+7(###) ### ## ##']" v-model="phone" :class="{'error':errors['phone']}" placeholder="+7 (___) ___ __ __"/>
                </div>
                <div class="row" style="margin-bottom: 20px;">
                    <label for="name">количество продавцов:</label>
                    <div class="button-group">
                        <input id="count-1" type="radio" v-model="count_sales" class="display-none" name="count" value="2-4">
                        <label for="count-1" class="label-radio">2-4</label>
                        <input id="count-2" type="radio" v-model="count_sales" class="display-none" name="count" value="5-10">
                        <label for="count-2" class="label-radio">5-10</label>
                        <input id="count-3" type="radio" v-model="count_sales" class="display-none" name="count" value="10+">
                        <label for="count-3" class="label-radio">10+</label>
                    </div>
                </div>
                <div style="display: none;" class="row">
                    <label for="approve" class="label-checkbox">
                        <span>Договор оферты</span>
                        <textarea disabled="disabled">ПУБЛИЧНЫЙ ДОГОВОР – ОФЕРТА
об оказании услуг (публичная оферта)
г.Алматы
Настоящий Договор является официальным предложением (публичной офертой) ТОО «КАРАДА» (далее
- «Исполнитель») для любого физического или юридического лица (далее – «Заказчик»), вместе
именуемые «Стороны», а по отдельности «Сторона», которое примет настоящее предложение, на
указанных ниже условиях.
В соответствии с пунктом 5 статьи 395 Гражданского Кодекса Республики Казахстан (далее - ГК РК),
содержащее все существенные условия договора предложение, из которого усматривается воля
физического или юридического лица, делающего предложение, заключить договор на указанных в
предложении условиях с любым, кто отзовется, признается офертой (публичная оферта).
Моментом полного и безоговорочного принятия Заказчиком предложения Исполнителя заключить договор
оферты (акцептом оферты), в соответствии со статьей 396 ГК РК, считается факт предоплаты Заказчиком
услуг Исполнителя.
Текст настоящего Договора оферты (далее по тексту – «Договор») расположен по адресу: www.karada.kz .
1. Термины и определения
1.1. Для целей настоящего Договора, приведенные ниже термины и определения используются в
следующем значении:
Оферта — настоящий документ Публичная Оферта продажи доступа к обучающему Онлайн-курсу.
Акцепт Оферты — полное и безоговорочное принятие Заказчиком условий настоящей Оферты, методами
предусмотренными в пунктом 3, данной Оферты.
Договор Оферты — договор между Исполнителем и Заказчиком на предоставление Услуг который
заключается посредством Акцепта Оферты.
Онлайн-курс — курс, состоящий из набора видеоуроков, аудио файлов, электронных документов, и тестов
Исполнителя.
1.2. В настоящей Оферте могут быть использованы термины, не определенные в пункте 1.1. В этом
случае толкование такого термина производится в соответствии с текстом настоящей Оферты. В случае
отсутствия однозначного толкования термина в тексте Оферты следует руководствоваться толкованием
термина: в первую очередь – на вебсайте Исполнителя, во вторую очередь – общепринятым значением.
2. Предмет Договора Оферты
2.1. Предметом настоящего Договора Оферты является возмездное предоставление Заказчику доступа к
обучающему Онлайн-курсу Исполнителя (далее – «Услуга»).
2.2. Библиотека Онлайн-курсов, стоимость, срок оказания Услуг и форма заявки размещены по адресу:
www.karada.kz .
2.3. Информация и иные материалы, в том числе на электронных носителях, аудио и видеозаписи,
предоставленные Заказчику Исполнителем в рамках оказания Услуг по настоящему Договору, являются
конфиденциальной информацией и собственностью Исполнителя, которая предназначенна
исключительно для Заказчика. В случае, если Заказчик допустит распространение указанной
информации, он несет ответственность перед Исполнителем за причиненные фактом распространения
информации убытки в виде штрафа, размер которого указан в пункте 8.2. настоящей Оферты.
2.4. Исполнитель имеет право изменять библиотеку Онлайн-курсов, стоимость, условия данной
Публичной Оферты без предварительного согласования с Заказчиком, обеспечивая при этом публикацию
измененных условий на вебсайте Исполнителя, а так же в общедоступном для ознакомления с этими
документами месте, не менее чем за 1 (один) рабочий дня до их ввода в действие.
3. Акцепт Оферты и заключение Договора Оферты
3.1. Заказчик производит Акцепт Оферты путем оплаты Услуг Исполнителя, в отношении которых
заключается Договор Оферты, с учетом условий описанных в пункте 5 настоящей Оферты.
4. Общие условия оказания Услуг
4.1. Исполнитель оказывает Услугу Заказчику только при выполнении следующих условий:
4.1.1. Заказчик отправил свои регистрационные данные, т.е. заполнил форму заявки/регистрации
размещенную по адресу: www.karada.kz
4.1.2. Заказчик осуществил Акцепт Оферты согласно пункту 3.1. настоящей Оферты.
4.2. Услуга предоставляется Заказчику в объеме, соответствующем сумме произведенной им оплаты.
4.3. Данные Услуги не являются образовательной деятельностью, не подлежат лицензированию, не
сопровождаются проведением итоговой аттестации, присвоения какой-либо квалификации и выдачей
документа об образовании в Республике Казахстан.
4.4. Услуги считаются оказанными надлежащим образом и в полном объеме, если в течение 1 (одного)
рабочего дня с момента окончания оказания услуг Заказчиком не выставлена рекламация. В случае
отсутствия рекламации Акт приемки-сдачи Услуг считается подписанным, а Услуги оказанными
надлежащим образом.
4.5. Стороны после оказания Услуг по Оферте не имеют друг к другу никаких претензий.
5. Стоимость Услуг и порядок расчетов 5.1. Стоимость Услуг указана на сайте: www.karada.kz .
5.1.1. Стоимость может быть изменена и зависит от:
- изменения налогового и/или иного законодательства Республики Казахстан;
- индивидуальной скидки Заказчика.
5.2. Оплата Услуг производится Заказчиком в порядке оплаты в размере 100% суммы Услуг.
5.3. Все расчеты по Договору производятся в национальной валюте Республики Казахстан - тенге.
5.4. Оплата производится путем перевода денежных средств на расчетный счет Исполнителя, указанных
на сайте: www.karada.kz.
5.5. Услуга будет считаться оплаченной с момента поступления денежных средств на расчетный счет
Исполнителя.
5.6. В случае отказа Заказчика от услуг Исполнитель не возвращает Заказчику сумму, поступившую на
расчетный счет Исполнителя по настоящей Оферте. Сторона, необоснованно уклоняющаяся от
заключения Оферты, должна возместить другой стороне убытки, вызванные отказом заключить Оферту.
5.7. Заказчик самостоятельно отслеживает изменение реквизитов Исполнителя, указанных в настоящей
Оферте, а также на сайте Исполнителя, и несет ответственность за правильность производимых им
платежей.
6. Права и обязанности Сторон
6.1. Исполнитель обязуется:
6.1.1. Обеспечивать Услугу в надлежащем качестве, в согласованный сторонами срок.
6.1.2. Предоставлять Заказчику:
- доступ к личному кабинету пользователю/слушателю Онлайн-курса, расположенному на сайте:
www.karada.kz; - доступа к обучающему Онлайн-курсу позволяющему изучать материал в виде аудиовидео-записей, интерактивных упражнений и документов / презентаций в электронном виде.
6.2. Исполнитель имеет право:
6.2.1. Изменять библиотеку Онлайн-курсов, стоимость, условия данной публичной Оферты без
предварительного согласования с Заказчиком;
6.2.2. Добавлять электронный адрес Заказчика, указанный при регистрации, в свой список рассылки
писем.
6.3. Заказчик обязуется:
6.3.1. Соблюдать все правила получения Услуг установленные Исполнителем данной Офертой;
6.3.2. Не распространять информационные материалы являющихся собственностью Исполнителя,
полученные в ходе оказания Услуг, а также не записывать их на аудио- и/или видеоносители, передавать
иным третьим лицам. В случае, если Заказчик допустит распространение указанной информации, он
несет ответственность в соответствии с законодательством Республики Казахстан, в т.ч. ГК РК, Кодексом
«Об административных правонарушениях» Республики Казахстан, включая без ограничений, Уголовным
Кодексом Республики Казахстан, перед Исполнителем за причиненные фактом распространения
информации убытки, включая недополученную прибыль, в размере указанным в пункте 8.2. Договора.
Заказчик уведомлен и обязан учитывать тот факт, что информационные материалы, к которым он
получает доступ в ходе оказания Услуг, являются объектом исключительного права Исполнителя и/или
иных правообладателей, защищаются законодательством Республики Казахстан об интеллектуальной
собственности.
6.4. Заказчик имеет право:
6.4.1. Отказаться от писем, присылаемых Исполнителем, перейдя по ссылке, указанной в электронном
письме.
7. Срок действия и изменение Оферты
7.1. Настоящая Оферта вступает в силу с момента совершения Заказчиком Акцепта Оферты и действует
до полного выполнения обязательств Сторонами.
7.2. Заказчик соглашается и признает, что внесение изменений в Оферту влечет за собой внесение этих
изменений в заключенный и действующий между Заказчиком и Исполнителем договор Оферты, и эти
изменения в вступают в силу одновременно с такими изменениями в Оферте.
8. Ответственность сторон
8.1. За невыполнение или ненадлежащее выполнение обязательств по настоящей Оферте, Стороны
несут ответственность, согласно действующему законодательству Республики Казахстан.
8.2. Заказчик несет ответственность согласно пункту 6.3.2. Договора в размере до 1000% (одна тысяча
процентов) от стоимости Услуг, оплаченных им.
8.3. Все споры и разногласия, которые могут возникнуть из настоящей Оферты или в связи с ней, должны
разрешаться путем переговоров между Сторонами. В случае невозможности достичь соглашения путем
переговоров, Стороны обращаются в соответствии с законодательством Республики Казахстан в суд
г.Алматы.
8.4. Не вступая в противоречие с указанным выше, Исполнитель освобождается от ответственности за
нарушение условий Договора Оферты, если такое нарушение вызвано действием обстоятельств
непреодолимой силы (форс-мажор), включая: действия органов государственной власти (в т.ч. принятие
правовых актов), пожар, наводнение, землетрясение, другие стихийные бедствия, отсутствие
электроэнергии и/или сбои работы компьютерной сети, забастовки, гражданские волнения, беспорядки,
любые иные обстоятельства, не ограничиваясь перечисленным, которые могут повлиять на исполнение
Исполнителем Договора Оферты.
8.5. Если иное не указано в настоящей Оферте, Исполнитель не несет ответственности за: косвенные
убытки, упущение прибыли, упущение выгоды, независимо от способа их причинения.
8.6. Оплата по данной Оферте означает согласие со всеми условиями (пунктами) перечисленными выше.
9. Реквизиты Исполнителя ТОО «________»
Исполнитель:
Почтовый адрес:
Банковские Реквизиты:
ИИН:
БИК:
KZ
                        </textarea>
                        <input id="approve" type="checkbox" :class="{'error':errors['approve']}" v-model="approve">Согласен(сна)
                    </label>
                </div>
                <div class="row">
                    <button @click="Send" class="button-yellow-stroke">отправить</button>
                    <!--                    <div class="error" v-html="messages"></div>-->
                </div>
            </div>

        </div>
        <div class="block modal-body" v-if="registered">
            <div class="close" rel="register-solo-close"></div>
            <a href="#" class="modal-body-header" style=" display: inline-block; border-radius: 23px; color: #fff; background-color: #37a2e9; padding: 10px 30px;">Спасибо!</a>
            <p style="color: #031a29; font-family: Montserrat; font-size: 20px; font-weight: 400; line-height: 30px; width: 236px; margin: 15px auto; ">
                Мы свяжемся с Вами в ближайшее время!
            </p>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                first_name: "",
                // last_name: "",
                email: "",
                phone: "",
                approve: true,
                messages: "",
                registered: false,
                count_sales: '2-4',
                errors: {},
            }
        },
        mounted() {
        },
        methods: {
            Send: function () {

                this.errors ={};

                let obj = {
                    first_name: this.first_name,
                    // last_name: this.last_name,
                    email: this.email,
                    phone: this.phone,
                    approve: this.approve,
                    count_sales:this.count_sales,
                    is_company:true
                };

                if (this.approve) {
                    this.$http.post('/application_registration', obj).then(response => {
                        this.registered = true;
                    }).catch(error => {
                        this.messages = '';
                        this.errors = {};
                        let data = error.response.data;
                        if (data.errors) {
                            for (let item in data.errors) {
                                this.errors[item] = true;
                                for (let item_ in data.errors[item]) {
                                    if(!this.messages) {
                                        this.messages += '<p>' + data.errors[item][item_] + '</p>';
                                    }
                                }
                            }
                        }
                    });
                }else{
                    this.errors['approve'] = true;
                }
            }
        },
        watch: {
            approve:function (i) {
                if(i){
                    this.errors['approve'] = false;
                }
            }
        }

    }
</script>
